benchmark/wrk2/bitmap-t1-c1-R100.txt
Running 30s test @ http://127.0.0.1:8091/v1/search/bitmap/prices
  1 threads and 1 connections
  Thread calibration: mean lat.: 1.263ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.35ms  386.67us   2.57ms   65.73%
    Req/Sec   105.62     50.70   222.00     75.73%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.36ms
 75.000%    1.62ms
 90.000%    1.86ms
 99.000%    2.19ms
 99.900%    2.46ms
 99.990%    2.57ms
 99.999%    2.57ms
100.000%    2.57ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.253     0.000000            1         1.00
       0.815     0.100000          202         1.11
       0.993     0.200000          400         1.25
       1.121     0.300000          600         1.43
       1.242     0.400000          801         1.67
       1.362     0.500000         1002         2.00
       1.408     0.550000         1100         2.22
       1.463     0.600000         1201         2.50
       1.513     0.650000         1301         2.86
       1.565     0.700000         1402         3.33
       1.618     0.750000         1501         4.00
       1.651     0.775000         1550         4.44
       1.690     0.800000         1601         5.00
       1.724     0.825000         1650         5.71
       1.764     0.850000         1700         6.67
       1.806     0.875000         1750         8.00
       1.834     0.887500         1775         8.89
       1.862     0.900000         1802        10.00
       1.885     0.912500         1825        11.43
       1.910     0.925000         1850        13.33
       1.936     0.937500         1875        16.00
       1.958     0.943750         1887        17.78
       1.975     0.950000         1900        20.00
       1.991     0.956250         1913        22.86
       2.002     0.962500         1925        26.67
       2.029     0.968750         1937        32.00
       2.037     0.971875         1944        35.56
       2.049     0.975000         1953        40.00
       2.053     0.978125         1956        45.71
       2.069     0.981250         1962        53.33
       2.081     0.984375         1968        64.00
       2.137     0.985938         1971        71.11
       2.171     0.987500         1975        80.00
       2.189     0.989062         1979        91.43
       2.203     0.990625         1981       106.67
       2.229     0.992188         1984       128.00
       2.247     0.992969         1985       142.22
       2.253     0.993750         1987       160.00
       2.279     0.994531         1989       182.86
       2.329     0.995313         1990       213.33
       2.375     0.996094         1992       256.00
       2.375     0.996484         1992       284.44
       2.403     0.996875         1993       320.00
       2.447     0.997266         1994       365.71
       2.451     0.997656         1995       426.67
       2.453     0.998047         1996       512.00
       2.453     0.998242         1996       568.89
       2.453     0.998437         1996       640.00
       2.461     0.998633         1997       731.43
       2.461     0.998828         1997       853.33
       2.531     0.999023         1998      1024.00
       2.531     0.999121         1998      1137.78
       2.531     0.999219         1998      1280.00
       2.531     0.999316         1998      1462.86
       2.531     0.999414         1998      1706.67
       2.569     0.999512         1999      2048.00
       2.569     1.000000         1999          inf
#[Mean    =        1.346, StdDeviation   =        0.387]
#[Max     =        2.568, Total count    =         1999]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3001 requests in 30.00s, 597.86KB read
Requests/sec:    100.03
Transfer/sec:     19.93KB